# coding=utf-8

import re

__author__ = 'Neta'


def translated_from_discussion(talk_text):
    # The function checks in the discussion (talk) pages whether there is an indication that the page is translated.
    # Input - talk page text
    # Output - a boolean indicator. True - if there is a match, False - otherwise.

    # note that we should use the page's title in order to find it's corresponding talk page (namespace 1) if exists.
    # add מאמר instead of ערך
    # expression that indicate that the page was translated
    reg_exp = [re.compile(r"^((== ?)?תורגם מאנגלית)", re.MULTILINE),
               re.compile(r"^(מו?ויקי ?אנגלית)", re.MULTILINE),
               re.compile(r"((הערך|המאמר).+תורגם(?!\.).+?אנגלי)"),
               re.compile(r"((תורגם|תרגום|תרגמתי)(?!.+(תורגם|תרגום|תרגמתי)).+?ויקי(?!\.).+?אנגלי)"),
               re.compile(r"((תורגם|תרגום|תרגמתי)(?!.+(תורגם|תרגום|תרגמתי)).+?(ערך|מאמר)(?!\.).+?אנגלי)"),
               re.compile(r"ערך מתורגם\|מקור=אנגלית"), re.compile(r"הערך.+תורגם ?==\n(.+?אנגלי)")]
    # {{Translated page|de|Eva Lang|version=139175172}}
    # reg_exp.append(re.compile(r"((תורגם|תרגום|תרגמתי).+?ויקי.+?אנגלי)"))
    # reg_exp.append(re.compile(r"((תורגם|תרגום|תרגמתי).+?ערך.+?אנגלי)"))

    # words hurting this indication - if found than the results is False
    bad_words = ["חלק", "r\bגוגל\b", "מכונה", "r\bלא\b", "רישול"]  #רובו

    found = False
    #text = TalkText.readline()  # if the input is in the same string
    #while ~found and text:
    for to_find in reg_exp:  # going over all the translated examples
        ans = to_find.search(talk_text)
        if ans is not None:
            found = True
            break
    if found:  # if found then looking in it for bad words
        phrase = ans.group(1)
        for bad in bad_words:
            if re.search(bad, phrase) is not None:
                found = False
                break
    # if is found and doesn't include bad words then returns True
    # otherwise (not found or includes bad words) then returns False
    return found


# example_text = "\u05ea\u05d5\u05e8\u05d2\u05dd \u05de\u05d5\u05d9\u05e7\u05d9 \u05d0\u05e0\u05d2\u05dc\u05d9\u05ea. [[\u05de\u05e9\u05ea\u05de\u05e9:\u05e1\u05e7\u05e8\u05dc\u05d8|\u05d7\u05dc\u05e3 \u05e2\u05dd \u05d4\u05e8\u05d5\u05d7]] 19:35, 24 \u05d3\u05e6\u05de\u05d1\u05e8 2005 (UTC)\n\n== \u05e7\u05d9\u05e9\u05d5\u05e8 \u05d7\u05d9\u05e6\u05d5\u05e0\u05d9 ==\n\n\u05d4\u05d0\u05ea\u05e8 \u05d4\u05e8\u05e9\u05de\u05d9 \u05e9\u05dc\u05d5 \u05de\u05ea. \u05e8\u05e9\u05de\u05d9\u05ea. [[\u05de\u05d9\u05d5\u05d7\u05d3:\u05ea\u05e8\u05d5\u05de\u05d5\u05ea/173.180.223.27|173.180.223.27]] 12:07, 13 \u05d1\u05d3\u05e6\u05de\u05d1\u05e8 2011 (IST)\n:\u05d6\u05d4 \u05dc\u05d0 \u05e0\u05db\u05d5\u05df!! \u05d6\u05d4 \u05dc\u05d0 \u05e0\u05db\u05d5\u05df! {{\u05d0\u05dc\u05de}}\n\n\u05de\u05d9 \u05d4\u05d5\u05d0? \u05de\u05d9 \u05d4\u05d5\u05d0? \u05de\u05d4 \u05d4\u05d5\u05d0 \u05d0\u05dc\u05df \u05d3\u05dc\u05d5\u05df? {{\u05d0\u05dc\u05de}}\n:\u05d4\u05db\u05dc \u05de\u05e4\u05d5\u05e8\u05d8 \u05dc\u05da \u05d1\u05e2\u05e8\u05da. &rlm;[[\u05de\u05e9\u05ea\u05de\u05e9:Fxp300|Hyuna]]&rlm; \u2022 [[\u05e9\u05d9\u05d7\u05ea \u05de\u05e9\u05ea\u05de\u05e9:Fxp300|\u05e9\u05d9\u05d7\u05d4]] \u2022 \u05d7\u05e6\u05d9\u05dc-\u05e6\u05d9\u05dc\u05d5\u05df \u2022 17:14, 16 \u05d1\u05d9\u05e0\u05d5\u05d0\u05e8 2013 (IST)\n\n== \u05ea\u05d5\u05d3\u05d4 \u05d5... ==\n\n\u05ea\u05d5\u05d3\u05d4 \u05e2\u05dc \u05d4\u05e2\u05e8\u05da \u05e9\u05d1\u05d5\u05d5\u05d3\u05d0\u05d9 \u05d6\u05db\u05d4 \u05dc\u05e4\u05d5\u05e4\u05d5\u05dc\u05d0\u05e8\u05d9\u05d5\u05ea \u05e8\u05d1\u05d4 \u05d1\u05d6\u05de\u05df \u05d4\u05d0\u05d7\u05e8\u05d5\u05df, \u05e8\u05e6\u05d9\u05ea\u05d9 \u05dc\u05e9\u05d0\u05d5\u05dc \u05d0\u05dd \u05d9\u05e9 \u05de\u05e7\u05d5\u05dd \u05dc\u05d4\u05d6\u05db\u05d9\u05e8 \u05d0\u05ea \u05d4\u05e2\u05d5\u05d1\u05d3\u05d4 \u05e9\u05d4\u05d5\u05d0 \u05de\u05d0\u05d5\u05d6\u05db\u05e8 \u05d1\u05ea\u05db\u05e0\u05d9\u05ea \"\u05d0\u05e8\u05e5 \u05e0\u05d4\u05d3\u05e8\u05ea\". \u05e8\u05d0\u05d9\u05ea\u05d9 \u05e9\u05dc\u05e4\u05e2\u05de\u05d9\u05dd \u05de\u05db\u05e0\u05d9\u05e1\u05d9\u05dd \u05d0\u05d9\u05d6\u05db\u05d5\u05e8\u05d9\u05dd \u05e9\u05dc \u05d3\u05de\u05d5\u05d9\u05d5\u05ea, \u05e9\u05d7\u05e7\u05e0\u05d9\u05dd, \u05de\u05e7\u05d5\u05de\u05d5\u05ea, \u05ea\u05d5\u05e4\u05e2\u05d5\u05ea \u05d5\u05db\u05d0\u05dc\u05d4 \u05d1\u05ea\u05e8\u05d1\u05d5\u05ea.\n\n\u05dc\u05de\u05d4 \u05dc\u05d0? \u05d6\u05d4 WIKI \u05d0\u05e4\u05e9\u05e8 \u05dc\u05d4\u05d5\u05e1\u05d9\u05e3 \u05d3\u05d1\u05e8\u05d9\u05dd."
# output = example_text.decode('unicode-escape')
# print output

# print repr(output)
#print repr("ל".decode("utf-8"))

#print re.findall("יש.*?עובדה".decode("utf-8"), output)[0].encode("utf8")

example_text = """
==הערך תורגם==
מהערך האנגלי במענה לבקשה בדף הבקשות לטיפול דחוף. אינני שולט ברזי הפוליטיקה הדנית ומי שמעוניין ויודע מוזמן להוסיף ולתקן במידת הצורך --[[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small>   20:00, 18 בספטמבר 2011 (IDT)

==תמונה==
[[קובץ: Thorning-Schmidt.jpg|250px|שמאל|ממוזער]]
התמונה הזאת הייתה במקור בערך. בעיניי היא טובה הרבה יותר. משום מה היא הוחלפה היום. אם לא יובאו נימוקים לתמונה הנוכחית, אשחזר אותה. [[משתמש:בורה בורה|בורה בורה]] - [[שיחת משתמש:בורה בורה|שיחה]] 18:32, 16 בפברואר 2015 (IST)
:החלפתי לתמונה שקיימת בכל הערכים של שמידט בויקי, הן באנגלי, בדני, בגרמנית ועוד. התמונה הזו עדיין מוצגת בערך, משום שהיא ראוייה מאוד. אך למרות זאת, התמונה מציגה זום קרוב מאוד לפניה של גברת שמידט, ומקובל שאצל ראשי ממשלות ישנה תמונה עם הטורסו של האדם. [[משתמש:Archwayh|Archwayh]] - [[שיחת משתמש:Archwayh|שיחה]] 18:44, 16 בפברואר 2015 (IST)
:: טוב שיהיה. בתמונה הזאת היא מחייכת ובשנייה חמורת סבר... וגם רואים את הפנים ולא את דוכן הנואמים. [[משתמש:בורה בורה|בורה בורה]] - [[שיחת משתמש:בורה בורה|שיחה]] 18:57, 16 בפברואר 2015 (IST)
::: [[משתמש:בורה בורה|בורה בורה]] ערב טוב. אני תמים דעים איתך. ראשית, לחלוטין לא צריך שתי תמונות. שנית, התמונה הקודמת הייתה טובה הרבה יותר משום הקלוז אפ. העובדה שהיא קיימת בחלק מהערכים הזרים, לא אומרת שצריך "לעבור לדום". עדיף לחזור למצב הקודם. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 19:45, 16 בפברואר 2015 (IST)
:::: הוצאת לי את המילים מהפה! ביחוד המשפט "עובדה שהיא קיימת בחלק מהערכים הזרים, לא אומרת שצריך "לעבור לדום"." [[משתמש:בורה בורה|בורה בורה]] - [[שיחת משתמש:בורה בורה|שיחה]] 19:46, 16 בפברואר 2015 (IST)
:::::כאמור, זה איננו הטיעון היחידי לטובת התמונה. דווקא הקלוז-אפ הוא הגורם הבעייתי, משום שראוי שלראשי ממשלות יהיו ותהיינה תמונות עם הטורסו שלהם/ן. כמו אצל [[ברק אובמה]], [[בנימין נתניהו]], [[ולדימיר פוטין]], [[דייוויד קמרון]] ועוד. בברכה, [[משתמש:Archwayh|Archwayh]] - [[שיחת משתמש:Archwayh|שיחה]] 19:57, 16 בפברואר 2015 (IST)
:::::: לנתניהו יש תמונה של הראש בלבד, עם קצת חזה. לכל השאר יש "תמונה מועמדת" עם צלם רשמי ופוזה. פה זה עם מיקרופון תקוע ובימת נאומים מעצבנת. וגם הפרצוף לא משהו. בקיצור, להחליף. [[משתמש:בורה בורה|בורה בורה]] - [[שיחת משתמש:בורה בורה|שיחה]] 20:17, 16 בפברואר 2015 (IST)
::::::: [[משתמש:Archwayh|Archwayh]] ערב טוב. ראוי לדעתך. כאמור, יש מחלוקת וכרגע אתה בדעת מיעוט. במצב הזה מחזירים לגירסא היציבה עם התמונה הקודמת וממשיכים לדון תוך הרחבת מעגל הדיון על ידי הפניית עורכים נוספים מלוח המודעות. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 21:37, 16 בפברואר 2015 (IST)
::::::::אין ערך להצבעה בדף שיחה, משום שיתכן ויש רבים בדעתי שכלל לא מודעים לקיומו של דיון זה. עדיף לערוך הצבעה מסודרת. [[משתמש:Archwayh|Archwayh]] - [[שיחת משתמש:Archwayh|שיחה]] 22:00, 16 בפברואר 2015 (IST)
::::::::: שום הצבעה ושום בטיח. לא מצביעים על כאלה זוטות. זימנתי מלוח המודעות ונלך לפי הרוב בדף השיחה. [[משתמש:בורה בורה|בורה בורה]] - [[שיחת משתמש:בורה בורה|שיחה]] 22:26, 16 בפברואר 2015 (IST)
::::::::::אני מוצא את התמונה שנמצאת כרגע בערך (עם השמלה/החליפה הכחולה) ראויה יותר על פני התמונה המוצגת כאן. [[משתמש:YoavR|יואב ר.]] - [[שיחת משתמש:YoavR|שיחה]] 15:47, 17 בפברואר 2015 (IST)
:::::::::::אנו בעמדת שיוויו, בינתיים התמונה נשארת. [[משתמש:Archwayh|Archwayh]] - [[שיחת משתמש:Archwayh|שיחה]] 20:49, 17 בפברואר 2015 (IST)
::::::::::: [[משתמש:Archwayh|Archwayh]], למען הפרוטוקול ולפני דעתו של קיפוד נחש. עמדתך אינה נכונה. בעיקרון כל עוד אין רוב לשינוי מחזירים למצב הקודם בגירסא היציבה. אני מכבד אותך ולכן לא החזרתי בעצמי, ולצורך העניין נחייה עם המצב עם סיום הדיון. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 07:40, 18 בפברואר 2015 (IST)
::::::::::::יש כאן שתי שאלות: הראשונה היא, איזה תמונה יותר טובה. לטעמי, התמונה בדף השיחה טובה יותר. התמונה שמופיעה כרגע בערך תפסה אותה באמצע מילה, ופיה (ובעקבותיו הפנים) נראה קצת מעוות, ובאופן כללי התמונה כאן נראית טוב יותר. לשאלה השנייה: הטענה שנשמעה כאן כאילו "ראוי שלראשי ממשלות יהיו ותהיינה תמונות עם הטורסו שלהם/ן" חסרת בסיס, לא מנומקת, ואינה נכונה (כלומר, בנוסף לעובדה שהאמירה שרירותית ואינה מנומקת, בפועל יש לנו ערכים לא מעטים של ראשי מדינות בהן התמונה שמופיעה אינה "תמונת טורסו", כמו [[וילי ברנדט]] ו[[בן גוריון]]) . משתמשים בתמונה הטובה והרלוונטית ביותר שיש (כוונתי ב"רלוונטית" לכך שבערך [[ג'ורג' פטון]], נעדיף תמונה מתקופת שירותו הצבאי, אפילו אם יש תמונה באיכות הרבה יותר גבוהה מבית אבות כשהוא בן 102). [[שיחת משתמש:קיפודנחש|קיפודנחש]] 01:01, 18 בפברואר 2015 (IST)
:::::::::::::התמונה של ת'ורנינג-שמיט בעמוד הזה היא סקסיסטית: היא שמה דגש על עיניה הכחולות והאיפור המוקפד שלה. היא נראית כנערה ביום שלג ולא כראש ממשלה. התמונה האחרת היא ההפך מזה, ולכן אני בעד התמונה השנייה. [[משתמש:YoavR|יואב ר.]] - [[שיחת משתמש:YoavR|שיחה]] 08:52, 18 בפברואר 2015 (IST)
:::::::::::::: מהערך "חיבתה של ת'ורנינג שמידט לבגדי מעצבים יוקרתיים, הדביקה לה את הכינוי "הלה [[גוצ'י]]"." אז משום שהיא מקפידה על לבוש ומראה ניתן תמונה דפוקה שלה? [[משתמש:בורה בורה|בורה בורה]] - [[שיחת משתמש:בורה בורה|שיחה]] 09:18, 18 בפברואר 2015 (IST)
:::::::::::::::בעיניי התמונה שאתה מכנה דפוקה היא תמונה סבירה. פגם נפל לדעתי דווקא בתמונה המוצגת בעמוד כאן, והסברתי למעלה למה. [[משתמש:YoavR|יואב ר.]] - [[שיחת משתמש:YoavR|שיחה]] 10:59, 18 בפברואר 2015 (IST)
:::::::::::::::: יואב. התמונה סקסיסטית לדעתך. יש דעות אחרות שטוענות שהיא מכבדת הרבה יותר את בעליה מהתמונה הקיימת והן נאמרו כאן ללא שום הקשר סקסיסטי. מדובר בטענת קש שנועדה לחזק דעה שכבר נאמרה ואין טעם לחזור עליה שוב ושוב. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 13:45, 18 בפברואר 2015 (IST)
:::::::::::::::::מוטי, אינני סבור שזו טענת קש. בעיני זה לב העניין. כ"כ לא ראיתי אותך מעיר לבורה בורה על הסגנון שלו, שלבטח איננו טוב משלי ואולי גרוע יותר (למשל '''"פה זה עם מיקרופון תקוע ובימת נאומים מעצבנת. וגם הפרצוף לא משהו"''' או '''"שום הצבעה ושום בטיח"'''). [[משתמש:YoavR|יואב ר.]] - [[שיחת משתמש:YoavR|שיחה]] 14:17, 18 בפברואר 2015 (IST)
:::::::::::::::::: לאחר המתנה סבירה ובהעדר רוב לשינוי החזרתי לגירסא הקודמת שהיא אגב, הגירסא היציבה. שמורה לכם הזכות לפתוח הצבעת מחלוקת. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 09:03, 23 בפברואר 2015 (IST)
:::::::::::::::::::על אף הביקורת שיש לי בנדון אני לא אטרח לפתוח הצבעה בנושא כזה. חבל על הזמן והעצבים. [[משתמש:YoavR|יואב ר.]] - [[שיחת משתמש:YoavR|שיחה]] 11:00, 23 בפברואר 2015 (IST)
:::::::::::::::::::: כאמור, התקבלה הכרעה בדף השיחה. לא חייבים להתעצבן כשדעתך איננה מתקבלת. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 11:47, 23 בפברואר 2015 (IST)
:::::::::::::::::::::אינני מבין למה זה נושא להערה מצדך בכלל. התעצבנתי אבל קיבלתי את ההכרעה (וגם הודעתי שלא אפתח הצבעה), ולא בפעם הראשונה. [[משתמש:YoavR|יואב ר.]] - [[שיחת משתמש:YoavR|שיחה]] 12:36, 23 בפברואר 2015 (IST)
:::::::::::::::::::::: לא התכוונתי להעיר לך. כתבתי מכיוון חיובי. המסר שלי היה "כּוּלָה תמונה", על זה להתעצבן?. כך זה שבמדיה מקוונת אין אפשרות להעביר שפת גוף, רק מלל. [[משתמש:Assayas|Assayas]] <small>•</small> [[שיחת משתמש:Assayas|שיחה]] <small>•</small> 15:56, 23 בפברואר 2015 (IST)
"""

example_text = """הדף לא תורגם על ידי מכונה, הוא תורגם על ידי מערך הויקיפדיה בשפה האנגלית מפני שלא מצאתי מקור טוב יותר למידע על ניבאלי. איני חושב שיש בכך בעייה. את מלאכתי עוד לא סיימתי בנוגע לערך זה, האם יש המלצות?
[[משתמש:Omeres|Omeres]] - [[שיחת משתמש:Omeres|שיחה]] 01:21, 18 ביולי 2014 (IDT)
"""

print translated_from_discussion(example_text)
